cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD20E18.svd
               <register>
                  <name>DATA</name>
                  <description>USART_INT Data</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x42000C00</baseAddress>
         <interrupt>
            <name>SERCOM1</name>
            <description>Serial Communication Interface 1</description>
            <value>8</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM2</name>
         <baseAddress>0x42001000</baseAddress>
         <interrupt>
            <name>SERCOM2</name>
            <description>Serial Communication Interface 2</description>
            <value>9</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM3</name>
         <baseAddress>0x42001400</baseAddress>
         <interrupt>
            <name>SERCOM3</name>
            <description>Serial Communication Interface 3</description>
            <value>10</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SYSCTRL</name>
         <version>U21002.0.1</version>
         <description>System Control</description>
         <baseAddress>0x40000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x44</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SYSCTRL</name>
            <description>System Controller</description>
            <value>1</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCLKSR</name>
               <description>Power and Clocks Status</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC8MRDY</name>
                     <description>OSC8M Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33RDY</name>
                     <description>BOD33 Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33DET</name>
                     <description>BOD33 Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B33SRDY</name>
                     <description>BOD33 Synchronization Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSC</name>
               <description>External Multipurpose Crystal Oscillator (XOSC) Control</description>
               <addressOffset>0x10</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAIN</name>
                     <description>Oscillator Gain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>GAINSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>2MHz</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>4MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>8MHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>16MHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>30MHz</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AMPGC</name>
                     <description>Automatic Amplitude Gain Control</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Start-Up Time</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE1</name>
                           <description>31 us</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2</name>
                           <description>61 us</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4</name>
                           <description>122 us</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE8</name>
                           <description>244 us</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16</name>
                           <description>488 us</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32</name>
                           <description>977 us</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE64</name>
                           <description>1953 us</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE128</name>
                           <description>3906 us</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE256</name>
                           <description>7813 us</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE512</name>
                           <description>15625 us</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE1024</name>
                           <description>31250 us</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2048</name>
                           <description>62500 us</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4096</name>
                           <description>125000 us</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE8192</name>
                           <description>250000 us</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16384</name>
                           <description>500000 us</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32768</name>
                           <description>1000000 us</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
